<template>
  <div class="m-4 bg-white p-4">
    <a-button @click="visible = true">预览</a-button>
    <an-viewer v-model:visible="visible" type="audio" :url="textUrl" :download="'s'" :name="'明日之星.png'"></an-viewer>
  </div>
</template>

<script setup lang="tsx">
import AnViewer from '@/components/AnViewer/AnViewer.vue';

const visible = ref(false);
const videoUrl = 'https://api.dogecloud.com/player/get.mp4?vcode=5ac682e6f8231991&userId=17&ext=.mp4'
const imageUrl =
  'https://images.unsplash.com/photo-1682687982468-4584ff11f88a?w=500&auto=format&fit=crop&q=60&ixlib=rb-4.0.3&ixid=M3wxMjA3fDF8MHxlZGl0b3JpYWwtZmVlZHwxfHx8ZW58MHx8fHx8';
const textUrl = `
1. 是非对错，有时只是角度问题。 2. 越在意什么，什么越会折磨你。 3. 反感一个人，连听见名字都恶心。 4.
温和久了，稍有脾气就成了恶人。 5. 离去的都是风景，留下的才是人生。 6. 任何安慰都没有自己看透来的奏效。 7.
我也想对每个人好，可狼我喂不饱。 8. 友情都存在着吃醋，更别说爱情了。 9. 原有前程可奔赴，亦有岁月可回首。 10.
偏见来自无非两个地方：无知和愚蠢。 11. 其实一切的问题，时间已经给了答案。 12.
所有偷过的懒，都会变成打脸的巴掌。 13. 信任变得很难，假的和真的越来越像。 14.
理性的人适合共事，感性的人适合共处。 15. 没有新故事的人，才会对过去念念不忘。 16.
你嘴巴那么毒，内心一定是有很多苦吧。 17. 人生有两次很棒，虚惊一场和失而复得。 18.
如果觉得生活苦，那就给自己撒点糖吧。 19. 如果没有见过光明，我本可以忍受黑暗。 20.
谁心里没有故事，只不过是学会了控制。 21. 我觉得单身挺好，可是一直却招人讽刺。 22.
我欣赏你的直言不讳，但请管好你的嘴。 23. 希望曾经的仰望，都能成为以后的日常。 24.
心若没有栖息的地方，到哪里都是流浪。 25. 越长大你越知道，有钱比有什么都舒坦。 26.
两个人的沟通，70%是情绪，30%是内容。 27. 不发生点烂事，永远看不清身边人的模样。 28.
对于我们最爱的人，不说永远，只说珍惜。 29. 多少次的义无反顾，在时间面前也得认输。 30.
我会等，因为最好的东西，总是压轴出场。 31. 幸福是比较级，要有东西垫底才感觉的到。 32.
在泥泞的道路上，要保持一颗玩泥巴的心。 33. 这世界上唯一扛得住岁月摧残的就是才华。 34.
半山腰总是最挤的，所以你得去山顶看看。 35. 电影是多么慈祥，总是让错过的人重新相逢。 36.
哭，并不是因为脆弱，而是因为坚强得太久。 37. 梦想成真之前，它看上去总是那么遥不可及。 38.
人生是场荒芜的旅行，冷暖自知，苦乐在心。 39. 如果每个人都理解你，那你得普通成什么样。 40.
少又不甘，多又嫌烦，哪有恰到好处的陪伴。 41. 听说过很多减肥方法，依然胖着过完这一生。 42.
我不在意你曾堕落，我只在意你是否会崛起。 43. 我可以受十分的苦，但我受不了半分的委屈。 44.
我要做个思想上的女流氓，生活上的好菇凉。 45. 小时候我们词不达意，长大后我们言不由衷。 46.
心上的纠葛，解的开，是结，解不开，是劫。 47. 因为陌生，所以勇敢；因为距离，所以美丽。 48.
这世界是如此喧哗，让沉默的人显得有点傻。 49. 自己生活贫乏的人，才喜欢刺探别人的私事。 50.
不讲道理是女人的特权，发脾气是女人的专利。 51. 历史，只有人名真的；小说，只有人名是假的。 52.
楼底与楼顶的风景，永远不同，谁也别羡慕谁。 53. 你都从没得到过名利，却跟我说什么淡泊名利。 54.
人类的极限是由少数人创造的，不能一概而论。 55. 生活总嘲笑我们太年轻，可青春却不经易老去。 56.
水凉了还可以喝，心凉了连说快乐都显得落寞。 57. 我希望躺在向日葵上，即使沮丧也能朝着阳光。 58.
喜欢发呆的人，心里一定有另一个纯净的世界。 59. 一个人需要隐藏多少秘密才能巧妙地度过一生。 60.
已婚者不安心，未婚者不甘心，旁观者太热心。 61. 长大这两个字连偏旁部首都没有，一看就孤独。
1. 是非对错，有时只是角度问题。 2. 越在意什么，什么越会折磨你。 3. 反感一个人，连听见名字都恶心。 4.
温和久了，稍有脾气就成了恶人。 5. 离去的都是风景，留下的才是人生。 6. 任何安慰都没有自己看透来的奏效。 7.
我也想对每个人好，可狼我喂不饱。 8. 友情都存在着吃醋，更别说爱情了。 9. 原有前程可奔赴，亦有岁月可回首。 10.
偏见来自无非两个地方：无知和愚蠢。 11. 其实一切的问题，时间已经给了答案。 12.
所有偷过的懒，都会变成打脸的巴掌。 13. 信任变得很难，假的和真的越来越像。 14.
理性的人适合共事，感性的人适合共处。 15. 没有新故事的人，才会对过去念念不忘。 16.
你嘴巴那么毒，内心一定是有很多苦吧。 17. 人生有两次很棒，虚惊一场和失而复得。 18.
如果觉得生活苦，那就给自己撒点糖吧。 19. 如果没有见过光明，我本可以忍受黑暗。 20.
谁心里没有故事，只不过是学会了控制。 21. 我觉得单身挺好，可是一直却招人讽刺。 22.
我欣赏你的直言不讳，但请管好你的嘴。 23. 希望曾经的仰望，都能成为以后的日常。 24.
心若没有栖息的地方，到哪里都是流浪。 25. 越长大你越知道，有钱比有什么都舒坦。 26.
两个人的沟通，70%是情绪，30%是内容。 27. 不发生点烂事，永远看不清身边人的模样。 28.
对于我们最爱的人，不说永远，只说珍惜。 29. 多少次的义无反顾，在时间面前也得认输。 30.
我会等，因为最好的东西，总是压轴出场。 31. 幸福是比较级，要有东西垫底才感觉的到。 32.
在泥泞的道路上，要保持一颗玩泥巴的心。 33. 这世界上唯一扛得住岁月摧残的就是才华。 34.
半山腰总是最挤的，所以你得去山顶看看。 35. 电影是多么慈祥，总是让错过的人重新相逢。 36.
哭，并不是因为脆弱，而是因为坚强得太久。 37. 梦想成真之前，它看上去总是那么遥不可及。 38.
人生是场荒芜的旅行，冷暖自知，苦乐在心。 39. 如果每个人都理解你，那你得普通成什么样。 40.
少又不甘，多又嫌烦，哪有恰到好处的陪伴。 41. 听说过很多减肥方法，依然胖着过完这一生。 42.
我不在意你曾堕落，我只在意你是否会崛起。 43. 我可以受十分的苦，但我受不了半分的委屈。 44.
我要做个思想上的女流氓，生活上的好菇凉。 45. 小时候我们词不达意，长大后我们言不由衷。 46.
心上的纠葛，解的开，是结，解不开，是劫。 47. 因为陌生，所以勇敢；因为距离，所以美丽。 48.
这世界是如此喧哗，让沉默的人显得有点傻。 49. 自己生活贫乏的人，才喜欢刺探别人的私事。 50.
不讲道理是女人的特权，发脾气是女人的专利。 51. 历史，只有人名真的；小说，只有人名是假的。 52.
楼底与楼顶的风景，永远不同，谁也别羡慕谁。 53. 你都从没得到过名利，却跟我说什么淡泊名利。 54.
人类的极限是由少数人创造的，不能一概而论。 55. 生活总嘲笑我们太年轻，可青春却不经易老去。 56.
水凉了还可以喝，心凉了连说快乐都显得落寞。 57. 我希望躺在向日葵上，即使沮丧也能朝着阳光。 58.
喜欢发呆的人，心里一定有另一个纯净的世界。 59. 一个人需要隐藏多少秘密才能巧妙地度过一生。 60.
已婚者不安心，未婚者不甘心，旁观者太热心。 61. 长大这两个字连偏旁部首都没有，一看就孤独。
1. 是非对错，有时只是角度问题。 2. 越在意什么，什么越会折磨你。 3. 反感一个人，连听见名字都恶心。 4.
温和久了，稍有脾气就成了恶人。 5. 离去的都是风景，留下的才是人生。 6. 任何安慰都没有自己看透来的奏效。 7.
我也想对每个人好，可狼我喂不饱。 8. 友情都存在着吃醋，更别说爱情了。 9. 原有前程可奔赴，亦有岁月可回首。 10.
偏见来自无非两个地方：无知和愚蠢。 11. 其实一切的问题，时间已经给了答案。 12.
所有偷过的懒，都会变成打脸的巴掌。 13. 信任变得很难，假的和真的越来越像。 14.
理性的人适合共事，感性的人适合共处。 15. 没有新故事的人，才会对过去念念不忘。 16.
你嘴巴那么毒，内心一定是有很多苦吧。 17. 人生有两次很棒，虚惊一场和失而复得。 18.
如果觉得生活苦，那就给自己撒点糖吧。 19. 如果没有见过光明，我本可以忍受黑暗。 20.
谁心里没有故事，只不过是学会了控制。 21. 我觉得单身挺好，可是一直却招人讽刺。 22.
我欣赏你的直言不讳，但请管好你的嘴。 23. 希望曾经的仰望，都能成为以后的日常。 24.
心若没有栖息的地方，到哪里都是流浪。 25. 越长大你越知道，有钱比有什么都舒坦。 26.
两个人的沟通，70%是情绪，30%是内容。 27. 不发生点烂事，永远看不清身边人的模样。 28.
对于我们最爱的人，不说永远，只说珍惜。 29. 多少次的义无反顾，在时间面前也得认输。 30.
我会等，因为最好的东西，总是压轴出场。 31. 幸福是比较级，要有东西垫底才感觉的到。 32.
在泥泞的道路上，要保持一颗玩泥巴的心。 33. 这世界上唯一扛得住岁月摧残的就是才华。 34.
半山腰总是最挤的，所以你得去山顶看看。 35. 电影是多么慈祥，总是让错过的人重新相逢。 36.
哭，并不是因为脆弱，而是因为坚强得太久。 37. 梦想成真之前，它看上去总是那么遥不可及。 38.
人生是场荒芜的旅行，冷暖自知，苦乐在心。 39. 如果每个人都理解你，那你得普通成什么样。 40.
少又不甘，多又嫌烦，哪有恰到好处的陪伴。 41. 听说过很多减肥方法，依然胖着过完这一生。 42.
我不在意你曾堕落，我只在意你是否会崛起。 43. 我可以受十分的苦，但我受不了半分的委屈。 44.
我要做个思想上的女流氓，生活上的好菇凉。 45. 小时候我们词不达意，长大后我们言不由衷。 46.
心上的纠葛，解的开，是结，解不开，是劫。 47. 因为陌生，所以勇敢；因为距离，所以美丽。 48.
这世界是如此喧哗，让沉默的人显得有点傻。 49. 自己生活贫乏的人，才喜欢刺探别人的私事。 50.
不讲道理是女人的特权，发脾气是女人的专利。 51. 历史，只有人名真的；小说，只有人名是假的。 52.
楼底与楼顶的风景，永远不同，谁也别羡慕谁。 53. 你都从没得到过名利，却跟我说什么淡泊名利。 54.
人类的极限是由少数人创造的，不能一概而论。 55. 生活总嘲笑我们太年轻，可青春却不经易老去。 56.
水凉了还可以喝，心凉了连说快乐都显得落寞。 57. 我希望躺在向日葵上，即使沮丧也能朝着阳光。 58.
喜欢发呆的人，心里一定有另一个纯净的世界。 59. 一个人需要隐藏多少秘密才能巧妙地度过一生。 60.
已婚者不安心，未婚者不甘心，旁观者太热心。 61. 长大这两个字连偏旁部首都没有，一看就孤独。
1. 是非对错，有时只是角度问题。 2. 越在意什么，什么越会折磨你。 3. 反感一个人，连听见名字都恶心。 4.
温和久了，稍有脾气就成了恶人。 5. 离去的都是风景，留下的才是人生。 6. 任何安慰都没有自己看透来的奏效。 7.
我也想对每个人好，可狼我喂不饱。 8. 友情都存在着吃醋，更别说爱情了。 9. 原有前程可奔赴，亦有岁月可回首。 10.
偏见来自无非两个地方：无知和愚蠢。 11. 其实一切的问题，时间已经给了答案。 12.
所有偷过的懒，都会变成打脸的巴掌。 13. 信任变得很难，假的和真的越来越像。 14.
理性的人适合共事，感性的人适合共处。 15. 没有新故事的人，才会对过去念念不忘。 16.
你嘴巴那么毒，内心一定是有很多苦吧。 17. 人生有两次很棒，虚惊一场和失而复得。 18.
如果觉得生活苦，那就给自己撒点糖吧。 19. 如果没有见过光明，我本可以忍受黑暗。 20.
谁心里没有故事，只不过是学会了控制。 21. 我觉得单身挺好，可是一直却招人讽刺。 22.
我欣赏你的直言不讳，但请管好你的嘴。 23. 希望曾经的仰望，都能成为以后的日常。 24.
心若没有栖息的地方，到哪里都是流浪。 25. 越长大你越知道，有钱比有什么都舒坦。 26.
两个人的沟通，70%是情绪，30%是内容。 27. 不发生点烂事，永远看不清身边人的模样。 28.
对于我们最爱的人，不说永远，只说珍惜。 29. 多少次的义无反顾，在时间面前也得认输。 30.
我会等，因为最好的东西，总是压轴出场。 31. 幸福是比较级，要有东西垫底才感觉的到。 32.
在泥泞的道路上，要保持一颗玩泥巴的心。 33. 这世界上唯一扛得住岁月摧残的就是才华。 34.
半山腰总是最挤的，所以你得去山顶看看。 35. 电影是多么慈祥，总是让错过的人重新相逢。 36.
哭，并不是因为脆弱，而是因为坚强得太久。 37. 梦想成真之前，它看上去总是那么遥不可及。 38.
人生是场荒芜的旅行，冷暖自知，苦乐在心。 39. 如果每个人都理解你，那你得普通成什么样。 40.
少又不甘，多又嫌烦，哪有恰到好处的陪伴。 41. 听说过很多减肥方法，依然胖着过完这一生。 42.
我不在意你曾堕落，我只在意你是否会崛起。 43. 我可以受十分的苦，但我受不了半分的委屈。 44.
我要做个思想上的女流氓，生活上的好菇凉。 45. 小时候我们词不达意，长大后我们言不由衷。 46.
心上的纠葛，解的开，是结，解不开，是劫。 47. 因为陌生，所以勇敢；因为距离，所以美丽。 48.
这世界是如此喧哗，让沉默的人显得有点傻。 49. 自己生活贫乏的人，才喜欢刺探别人的私事。 50.
不讲道理是女人的特权，发脾气是女人的专利。 51. 历史，只有人名真的；小说，只有人名是假的。 52.
楼底与楼顶的风景，永远不同，谁也别羡慕谁。 53. 你都从没得到过名利，却跟我说什么淡泊名利。 54.
人类的极限是由少数人创造的，不能一概而论。 55. 生活总嘲笑我们太年轻，可青春却不经易老去。 56.
水凉了还可以喝，心凉了连说快乐都显得落寞。 57. 我希望躺在向日葵上，即使沮丧也能朝着阳光。 58.
喜欢发呆的人，心里一定有另一个纯净的世界。 59. 一个人需要隐藏多少秘密才能巧妙地度过一生。 60.
已婚者不安心，未婚者不甘心，旁观者太热心。 61. 长大这两个字连偏旁部首都没有，一看就孤独。
`;
</script>

<style scoped></style>

<route lang="json">
{
  "meta": {
    "sort": 10001,
    "title": "概览",
    "icon": "icon-park-outline-home"
  }
}
</route>
@/components/AnForm/components/useFormModel
